hankso/esp32/espbase/main/drivers.c
/******************************************************************************
 * SPI Master interface
 */

#ifdef CONFIG_BASE_USE_SPI
static void spi_initialize() {
    spi_bus_config_t buf_conf = {
        .mosi_io_num = PIN_MOSI,
        .miso_io_num = PIN_MISO,
        .sclk_io_num = PIN_SCLK,
        .quadwp_io_num = GPIO_NUM_NC,
        .quadhd_io_num = GPIO_NUM_NC,
#   if defined(CONFIG_BASE_SCREEN_SPI) && defined(WITH_LVGL)
        .max_transfer_sz = CONFIG_BASE_SCREEN_HRES * CONFIG_BASE_SCREEN_VRES,
#   endif
        .flags = SPICOMMON_BUSFLAG_MASTER,
    };
    esp_err_t err = spi_bus_initialize(NUM_SPI, &buf_conf, SPI_DMA_CH_AUTO);
    if (err && err != ESP_ERR_INVALID_STATE)
        ESP_LOGE(TAG, "SPI init failed: %s", esp_err_to_name(err));
}
#endif

/******************************************************************************
 * I2C Master interface
 */

#ifdef CONFIG_BASE_USE_I2C
static void i2c_initialize() {
    i2c_config_t i2c_conf = {
        .mode               = I2C_MODE_MASTER,
        .sda_io_num         = PIN_SDA,
        .sda_pullup_en      = GPIO_PULLUP_ENABLE,
        .scl_io_num         = PIN_SCL,
        .scl_pullup_en      = GPIO_PULLUP_ENABLE,
        .master.clk_speed   = CONFIG_BASE_I2C_SPEED,
    };
    ESP_ERROR_CHECK( i2c_param_config(NUM_I2C, &i2c_conf) );
    ESP_ERROR_CHECK( i2c_driver_install(NUM_I2C, i2c_conf.mode, 0, 0, 0) );
}

esp_err_t smbus_probe(int bus, uint8_t addr) {
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (addr << 1) | I2C_MASTER_WRITE, true);
    i2c_master_stop(cmd);
    esp_err_t err = i2c_master_cmd_begin(bus, cmd, TIMEOUT(20));
    i2c_cmd_link_delete(cmd);
    return err;
}

esp_err_t smbus_wregs(
    int bus, uint8_t addr, uint16_t reg, uint8_t *val, size_t len
) {
    // SMBus Write protocol:
    //      S | (ADDR + W) | ACK | REG | ACK | {DATA | ACK} * n | P
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, addr << 1 | I2C_MASTER_WRITE, true);
    if (SMBUS_IS_WORD(reg)) {
        i2c_master_write_byte(cmd, SMBUS_HI_WORD(reg), true);
        i2c_master_write_byte(cmd, SMBUS_LO_WORD(reg), true);
    } else {
        i2c_master_write_byte(cmd, reg, true);
    }
    i2c_master_write(cmd, val, len, true);
    i2c_master_stop(cmd);
    esp_err_t err = i2c_master_cmd_begin(bus, cmd, TIMEOUT(20 * len));
    i2c_cmd_link_delete(cmd);
    return err;
}

esp_err_t smbus_rregs(
    int bus, uint8_t addr, uint16_t reg, uint8_t *val, size_t len
) {
    // SMBus Read protocol:
    //      S | (ADDR + W) | ACK | REG | ACK |
    //      S | (ADDR + R) | ACK | {DATA | ACK} * (n - 1) | DATA | NACK | P
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, addr << 1 | I2C_MASTER_WRITE, true);
    if (SMBUS_IS_WORD(reg)) {
        i2c_master_write_byte(cmd, SMBUS_HI_WORD(reg), true);
        i2c_master_write_byte(cmd, SMBUS_LO_WORD(reg), true);
    } else {
        i2c_master_write_byte(cmd, reg, true);
    }
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, addr << 1 | I2C_MASTER_READ, true);
    if (len > 1) i2c_master_read(cmd, val, len - 1, I2C_MASTER_ACK);
    i2c_master_read_byte(cmd, val + len - 1, I2C_MASTER_NACK);
    i2c_master_stop(cmd);
    esp_err_t err = i2c_master_cmd_begin(bus, cmd, TIMEOUT(20 * len));
    i2c_cmd_link_delete(cmd);
    return err;
}
#else // CONFIG_BASE_USE_I2C
esp_err_t smbus_probe(int b, uint8_t a) {
    return ESP_ERR_NOT_SUPPORTED; NOTUSED(b); NOTUSED(a);
}
esp_err_t smbus_wregs(int b, uint8_t a, uint16_t r, uint8_t *v, size_t l) {
    return ESP_ERR_NOT_SUPPORTED;
    NOTUSED(b); NOTUSED(a); NOTUSED(r); NOTUSED(v); NOTUSED(l);
}
esp_err_t smbus_rregs(int b, uint8_t a, uint16_t r, uint8_t *v, size_t l) {
    return ESP_ERR_NOT_SUPPORTED;
    NOTUSED(b); NOTUSED(a); NOTUSED(r); NOTUSED(v); NOTUSED(l);
}
#endif // CONFIG_BASE_USE_I2C

esp_err_t smbus_write_byte(int bus, uint8_t addr, uint16_t reg, uint8_t val) {
    return smbus_wregs(bus, addr, reg, &val, 1);
}

esp_err_t smbus_read_byte(int bus, uint8_t addr, uint16_t reg, uint8_t *val) {
    return smbus_rregs(bus, addr, reg, val, 1);
}

esp_err_t smbus_write_word(int bus, uint8_t addr, uint16_t reg, uint16_t val) {
    uint8_t buf[2] = { val >> 8, val & 0xFF };
    return smbus_wregs(bus, addr, reg, buf, 2);
}

esp_err_t smbus_read_word(int bus, uint8_t addr, uint16_t reg, uint16_t *val) {
    uint8_t buf[2] = { 0, 0 };
    esp_err_t err = smbus_rregs(bus, addr, reg, buf, 2);
    if (!err) *val = buf[0] << 8 | buf[1];
    return err;
}

esp_err_t smbus_dump(int bus, uint8_t addr, uint16_t reg, size_t num) {
    esp_err_t err = ESP_ERR_INVALID_ARG;
    uint8_t *buf = NULL, length = 16, wb = SMBUS_IS_WORD(reg) ? 4 : 2;
    reg = SMBUS_HI_WORD(reg) << 8 | SMBUS_LO_WORD(reg);
    if (!addr || !num || ( err = EMALLOC(buf, num) ) ||
        ( err = smbus_rregs(bus, addr, reg, buf, num) )) goto exit;
    printf("I2C %d-%02X register table 0x%0*X - 0x%0*X\n%*s",
           bus, addr, wb, reg, wb, reg + num, wb, "");
    LOOPN(i, length) { printf(" %02X", i); }
    if (reg % length) // pad start spaces
        printf("\n%0*X%*s", wb, reg - (reg % length), 3 * (reg % length), "");
    LOOPN(i, num) {
        if ((i + reg) % length == 0)
            printf("\n%0*X", wb, i + reg); // newline
        printf(" %02X", buf[i]);
    }
    putchar('\n');
exit:
    TRYFREE(buf);
    return err;
}

esp_err_t smbus_toggle(int bus, uint8_t addr, uint16_t reg, uint8_t bit) {
    uint8_t val = 0, mask = BIT(bit);
    esp_err_t err = smbus_read_byte(bus, addr, reg, &val);
    if (val & mask) {
        val &= ~mask;
    } else {
        val |= mask;
    }
    return err ?: smbus_write_byte(bus, addr, reg, val);
}

static bool i2c_master_inited(int bus) {
    esp_err_t err = smbus_probe(bus, 0);
    return err != ESP_ERR_INVALID_ARG && err != ESP_ERR_INVALID_STATE;
}

void i2c_detect(int bus) {
    if (!i2c_master_inited(bus)) return;
    LOOPN(i, 0x10) {
        if (!i) printf("  ");
        printf(" %02X", i);
    }
    LOOPN(addr, 0x7F) {
        if (addr % 0x10 == 0)
            printf("\n%02X", addr);
        if (!addr) {
            printf("   ");
            continue;
        }
        switch (smbus_probe(bus, addr)) {
        case ESP_OK:            printf(" %02X", addr); break;
        case ESP_ERR_TIMEOUT:   printf(" UU"); break;
        default:                printf(" --");
        }
        fflush(stdout);
    }
}

