hankso/esp32/espbase/main/drivers.c
/******************************************************************************
 * GPIO Expander
 */

#ifdef CONFIG_BASE_GPIOEXP_I2C
static const uint8_t i2c_pin_addr[3] = { 0b0100000, 0b0100001, 0b0100010 };
static uint8_t i2c_pin_data[3] = { 0, 0, 0 }, i2c_pin_probed[3];

static esp_err_t i2c_gexp_set_level(gexp_num_t pin, bool level) {
    if (!PIN_IS_I2CEXP(pin)) return ESP_ERR_INVALID_ARG;
    uint8_t num = pin - PIN_I2C_BASE, idx = num >> 3, mask = BIT(num & 0x7);
    if (!i2c_pin_probed[idx]) return ESP_ERR_NOT_FOUND;
    uint8_t addr = i2c_pin_addr[idx], *datp = i2c_pin_data + idx;
    *datp = level ? (*datp | mask) : (*datp & ~mask);
    return i2c_master_write_to_device(NUM_I2C, addr, datp, 1, 20);
}

static esp_err_t i2c_gexp_get_level(gexp_num_t pin, bool *level, bool sync) {
    if (!PIN_IS_I2CEXP(pin)) return ESP_ERR_INVALID_ARG;
    uint8_t num = pin - PIN_I2C_BASE, idx = num >> 3, mask = BIT(num & 0x7);
    if (!i2c_pin_probed[idx]) return ESP_ERR_NOT_FOUND;
    uint8_t addr = i2c_pin_addr[idx], *datp = i2c_pin_data + idx;
    esp_err_t err = ESP_OK;
    if (sync) err = i2c_master_read_from_device(NUM_I2C, addr, datp, 1, 20);
    if (!err) *level = *datp & mask;
    return err;
}
#endif

#ifdef CONFIG_BASE_GPIOEXP_SPI
static spi_device_handle_t spi_pin_hdl = NULL;
static spi_transaction_t spi_pin_trans;
static uint8_t *spi_pin_data;

static esp_err_t spi_gexp_set_level(gexp_num_t pin, bool level) {
    if (!spi_pin_hdl) return ESP_ERR_INVALID_STATE;
    if (!PIN_IS_SPIEXP(pin)) return ESP_ERR_INVALID_ARG;
    int num = pin - PIN_SPI_BASE;
    uint8_t idx = num >> 3, mask = BIT(num & 0x7), *datp = spi_pin_data + idx;
    *datp = level ? (*datp | mask) : (*datp & ~mask);
    return spi_device_polling_transmit(spi_pin_hdl, &spi_pin_trans);
}

static esp_err_t spi_gexp_get_level(gexp_num_t pin, bool *level, bool sync) {
    if (!spi_pin_hdl) return ESP_ERR_INVALID_STATE;
    if (!PIN_IS_SPIEXP(pin)) return ESP_ERR_INVALID_ARG;
    int num = pin - PIN_SPI_BASE;
    uint8_t idx = num >> 3, mask = BIT(num & 0x7), *datp = spi_pin_data + idx;
    esp_err_t err = ESP_OK;
    if (sync) err = spi_device_polling_transmit(spi_pin_hdl, &spi_pin_trans);
    if (!err) *level = *datp & mask;
    return err;
}
#endif

#ifdef CONFIG_BASE_USE_GPIOEXP
static UNUSED void IRAM_ATTR gexp_isr(void *arg) {
#   ifdef CONFIG_BASE_GPIOEXP_INT
    ets_printf("PIN_INT %s\n", gpio_get_level(PIN_INT) ? "RISE" : "FALL");
#   endif
#   ifdef CONFIG_BASE_GPIOEXP_I2C
    LOOPN(i, LEN(i2c_pin_data)) {
        if (i2c_gexp_get_level(PIN_I2C_BASE + i * 8, NULL, true)) continue;
        ets_printf("I2C GPIOExp: %s\n", format_binary(i2c_pin_data[i], 1));
    }
#   endif
#   ifdef CONFIG_BASE_GPIOEXP_SPI
    if (spi_gexp_get_level(PIN_SPI_BASE, NULL, true)) return;
    LOOPN(i, PIN_SPI_COUNT / 8) {
        ets_printf("SPI GPIOExp: %s\n", format_binary(spi_pin_data[i], 1));
    }
#   endif
}

static void gexp_initialize() {
    esp_err_t err;
#   ifdef CONFIG_BASE_GPIOEXP_I2C
    if (PIN_I2C_COUNT > (LEN(i2c_pin_data) * 8) || PIN_I2C_COUNT <= 0) {
        ESP_LOGE(TAG, "Invalid I2C GPIOExp pin count: %d", PIN_I2C_COUNT);
        return;
    }
    uint8_t found = 0;
    LOOPN(i, LEN(i2c_pin_data)) {
        err = smbus_probe(NUM_I2C, i2c_pin_addr[i]);
        if (err == ESP_ERR_INVALID_STATE) break; // driver not installed
        found += (i2c_pin_probed[i] = err == ESP_OK);
    }
    if (!found) {
        err = ESP_ERR_NOT_FOUND;
        ESP_LOGE(TAG, "I2C GPIOExp init error: %s", esp_err_to_name(err));
    }
#   endif
#   ifdef CONFIG_BASE_GPIOEXP_SPI
    // If the transmitted data is 32bits or less, it is preferred to use
    // tx_data in spi_transaction_t. Each expander chip uses 8bits.
    if (PIN_SPI_COUNT % 8 || PIN_SPI_COUNT <= 0) {
        ESP_LOGE(TAG, "Invalid SPI GPIOExp pin count: %d", PIN_SPI_COUNT);
        return;
    }
    if (PIN_SPI_COUNT <= 32) {
        spi_pin_data = spi_pin_trans.tx_data;
        spi_pin_trans.flags = SPI_TRANS_USE_TXDATA;
        spi_pin_trans.length = PIN_SPI_COUNT;
    } else if (ECALLOC(spi_pin_data, 1, PIN_SPI_COUNT / 8)) {
        ESP_LOGE(TAG, "Could not allocate memory for SPI GPIOExp");
        return;
    } else {
        spi_pin_trans.length = PIN_SPI_COUNT;
        spi_pin_trans.tx_buffer = spi_pin_data;
    }
    spi_device_interface_config_t dev_conf = {
        .command_bits = 0,
        .address_bits = 0,
        .dummy_bits = 0,
        .mode = 0b10,                       // CPOL = 1, CPHA = 0
        .duty_cycle_pos = 128,              // 128/256 = 50% (Tlow = Thigh)
        .cs_ena_pretrans = 0,
        .cs_ena_posttrans = 0,
        .clock_speed_hz = SPI_MASTER_FREQ_8M,
        .input_delay_ns = 0,
        .spics_io_num = PIN_CS2,
        .flags = 0,
        .queue_size = 1,                    // only one transaction allowed
        .pre_cb = NULL,
        .post_cb = NULL
    };
    err = spi_bus_add_device(NUM_SPI, &dev_conf, &spi_pin_hdl);
    if (err) ESP_LOGE(TAG, "SPI GPIOExp init error: %s", esp_err_to_name(err));
#   endif
#   ifdef CONFIG_BASE_GPIOEXP_INT
    gpio_config_t int_conf = {
        .pin_bit_mask = BIT64(PIN_INT),
        .mode         = GPIO_MODE_INPUT,
        .pull_up_en   = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_ANYEDGE,
    };
    if (!strcasecmp(Config.sys.INT_EDGE, "HIGH")) {
        int_conf.intr_type = GPIO_INTR_HIGH_LEVEL;
        int_conf.pull_down_en = GPIO_PULLDOWN_ENABLE;
    } else if (!strcasecmp(Config.sys.INT_EDGE, "LOW")) {
        int_conf.intr_type = GPIO_INTR_LOW_LEVEL;
    } else if (!strcasecmp(Config.sys.INT_EDGE, "POS")) {
        int_conf.intr_type = GPIO_INTR_POSEDGE;
        int_conf.pull_down_en = GPIO_PULLDOWN_ENABLE;
    } else if (!strcasecmp(Config.sys.INT_EDGE, "NEG")) {
        int_conf.intr_type = GPIO_INTR_NEGEDGE;
    }
    ESP_ERROR_CHECK( gpio_config(&int_conf) );
    ESP_ERROR_CHECK( gpio_install_isr_service(0) );
    ESP_ERROR_CHECK( gpio_isr_handler_add(PIN_INT, gexp_isr, NULL) );
#   endif
}
#endif

